[
    {
        "CollectionID": 1,
        "desc_en": "Ṣaḥīḥ al-Bukhārī (Arabic: صحيح البخاري‎), is one of the Kutub al-Sittah (six major hadith collections) of Sunni Islam. These prophetic traditions, or hadith, were collected by the Persian Muslim scholar Muhammad al-Bukhari, after being transmitted orally for generations. Sunni Muslims view this as one of the three most trusted collections of hadith along with Sahih Muslim and Muwatta Imam Malik.[1] In some circles, it is considered the most authentic book after the Quran.[2][3] The Arabic word sahih translates as authentic or correct The actual title of the book commonly referred to as Sahih al-Bukhari, according to Ibn al-Salah, is: al-Jaami’ al-Sahih al-Musnad al-Mukhtasar min Umur Rasool Allah wa sunanihi wa Ayyamihi. A word for word translation is: The Abridged Collection of Authentic Hadith with Connected Chains regarding Matters Pertaining to the Prophet, His practices and His Times.[3] Ibn Hajar al-Asqalani mentioned the same title replacing the word umur, matters, with hadith Al-Bukhari traveled widely throughout the Abbasid empire from the age of 16, collecting those traditions he thought trustworthy. It is said that al-Bukhari collected over 300,000 hadith and included only 2,602 traditions in his Sahih.[6] At the time when Bukhari saw [the earlier] works and conveyed them, he found them, in their presentation, combining between what would be considered sahih and hasan and that many of them included daʻīf hadith. This aroused his interest in compiling hadith whose authenticity was beyond doubt. What further strengthened his resolve was something his teacher, hadith scholar Ishaq ibn Ibrahim al-Hanthalee – better known as Ishaq Ibn Rahwayh – had said. Muhammad ibn Ismaa’eel al-Bukhari said, \"We were with Ishaq Ibn Rahwayh who said, ‘If only you would compile a book of only authentic narrations of the Prophet.’ This suggestion remained in my heart so I began compiling the Sahih.\" Bukhari also said, \"I saw the Prophet in a dream and it was as if I was standing in front of him. In my hand was a fan with which I was protecting him. I asked some dream interpreters, who said to me, ‘You will protect him from lies.’ This is what compelled me to produce the Sahih.\"[7]\n\nThe book covers almost all aspects of life in providing proper guidance of Islam such as the method of performing prayers and other actions of worship directly from the Islamic prophet Muhammad. Bukhari finished his work around 846, and spent the last twenty-four years of his life visiting other cities and scholars, teaching the hadith he had collected. In every city that he visited, thousands of people would gather in the main mosque to listen to him recite traditions. In reply to Western academic doubts as to the actual date and authorship of the book that bears his name, scholars point out that notable hadith scholars of that time, such as Ahmad ibn Hanbal (855 CE/241 AH), Yahya ibn Ma'in (847 CE/233 AH), and Ali ibn al-Madini (848 CE/234 AH), accepted the authenticity of his book[8] and that the collection's immediate fame makes it unlikely that it could have been revised after the author's death without historical record.\n\nDuring this period of twenty-four years, Bukhari made minor revisions to his book, notably the chapter headings. Each version is named by its narrator. According to Ibn Hajar al-Asqalani in his book Nukat, the number of hadiths in all versions is the same. The most famous one today is the version narrated by al-Firabri (d. 932 CE/320 AH), a trusted student of Bukhari. Al-Khatib al-Baghdadi in his book History of Baghdad quoted Firabri as saying: \"About seventy thousand people heard Sahih Bukhari with me\".\n\nFirabri is not the only transmitter of Sahih al-Bukhari. There were many others that narrated that book to later generations, such as Ibrahim ibn Ma'qal (d. 907 CE/295 AH), Hammad ibn Shaker (d. 923 CE/311 AH), Mansur Burduzi (d. 931 CE/319 AH) and Husain Mahamili (d. 941 CE/330 AH). There are many books that noted differences between these versions, the best known being Fath al-Bari.",
        "name_en": "Sahih Bukhari"
    },
    {
        "CollectionID": 2,
        "desc_en": "Sahih Muslim (Arabic: صحيح مسلم, ṣaḥīḥ Muslim, full title Al-Musnadu Al-Sahihu bi Naklil Adli) is one of the Kutub al-Sittah (six major ahadith) of the hadith in Sunni Islam. It is the second most authentic hadith collection after Sahih al-Bukhari, and is highly acclaimed by Sunni Muslims. It was collected by Muslim ibn al-Hajjaj, also known as Imam Muslim. Sahih translates as authentic or correct. The collector of the Sahih Muslim, Muslim ibn al-Hajjaj, was born into a Persian family in 204 AH (817/18 CE) in Nishapur (in modern-day Iran) and died in 261 AH (874/75 CE) in the city of his birth. He traveled widely to gather his collection of ahadith (plural of hadith), including to areas now in Iraq, the Arabian Peninsula, Syria and Egypt.\n\nOut of 300,000 hadith which he evaluated, approximately 4,000 were extracted for inclusion into his collection based on stringent acceptance criteria. Each report in his collection was checked and the veracity of the chain of reporters was painstakingly established. Sunni Muslims consider it the second most authentic hadith collection, after Sahih al-Bukhari. Sahih Muslim is divided into 43 books, containing a total of 7190 narrations. However, it is important to realize that Muslim ibn al-Hajjaj never claimed to collect all authentic traditions as his goal was to collect only traditions that all Muslims should agree on about accuracy.\n\nAccording to Munthiri, there are a total of 2,200 hadiths (without repetition) in Sahih Muslim. According to Muhammad Amin,[2] there are 1,400 authentic hadiths that are reported in other books, mainly the six major hadith collections.  Muslims regard this collection as the second most authentic of the six major hadith collections,[3] containing only sahih hadith, an honor it shares only with Sahih al-Bukhari, both being referred to as the Two Sahihs. Shia Muslims (and some sunnis) dismiss some of its contents as fabrications or untrustworthy due to the questionable reliability of some narrators",
        "name_en": "Sahih Muslim"
    },
    {
        "CollectionID": 3,
        "desc_en": "Al-Nasā'ī (214 – 303 AH; c. 829 – 915 CE), full name Aḥmad ibn Shu`ayb ibn Alī ibn Sīnān Abū `Abd ar-Raḥmān al-Nasā'ī, was a noted collector of hadith (sayings of Muhammad), and wrote one of the six canonical hadith collections recognized by Sunni Muslims, Sunan al-Sughra, or \"Al-Mujtaba\", which he selected from his \"As-Sunan al-Kubra\". As well as 15 other books, 6 dealing with the science of hadith. Abu Abdurrahman Ahmed ibn Shuaib ibn Ali ibn Sinan ibn Bahr ibn Dinar Al-Khurusani was born in the year 215 A.H as the Imam clearly states himself (although some say 255 A.H or 214 A.H) in the city of Nasa, situated in Western Asia known at that time as Khurusan which was a centre for Islamic Knowledge where millions of Ulama'a were situated and Hadeeth and Fiqh was at its peak. Thus he primarily attended the gatherings and circles of knowledge (known as halqas') in his town and attained knowledge, especially Hadeeth from the Ulama'a. Thereafter his inspiration increased of traveling around the world to seek knowledge from other various scholars of different countries and cities. When he was 20 years old, he started traveling and made his first journey to Qutaibah. He covered the whole Arabian Peninsula seeking knowledge from the Ulama and Muhadditheen of Iraq, Kufa, Hijaz, Syria and Egypt . Finally he decided to stay in Egypt .",
        "name_en": "An Nasai"
    },
    {
        "CollectionID": 4,
        "desc_en": "Abu Dawud Sulaymān ibn al-Ashʿath al-Azdi as-Sijistani (Persian/Arabic: أبو داود سليمان بن الأشعث الأزدي السجستاني), commonly known as Abu Dawud, was a noted Persian collector of prophetic hadith, and compiled the third of the six \"canonical\" hadith collections recognized by Sunni Muslims, the Sunan Abī Dāwūd. He was born in Sistan, in east of Iran, (then Persia) and died in 889 in Basra. Widely traveled among scholars of hadith, he went to Iraq, Egypt, Syria, Hijaz, Tihamah, Khurasan, Nishapur, and Marv among other places in order to collect hadith. He was primarily interested in jurisprudence, and as a result the collection by him focuses largely on legal hadith. Out of about 500,000 hadith, he chose 4,800 for inclusion in his work. He wrote some 21 books in total. Some of the most prominent are:\n\n    Sunan Abī Dāwūd, containing some 4,800 hadith, is his principal work. They are usually numbered after the edition of Muhammad Muhyi al-Din `Abd al-Hamid (Cairo: Matba`at Mustafa Muhammad, 1354/1935), where 5,274 are distinguished. Some of his hadith are not sahih, but he claimed that all hadith listed were sahih unless specifically indicated otherwise; this has been controversial among Islamic scholars, since some, such as Ibn Hajar al-Asqalani believe some of the unmarked ones to be ḍaʿīf as well.\n    In another work, Kitab al-Marāsīl, he lists 600 mursal hadith which, after extensive background investigation, he concludes are nonetheless sahih.\n    Risālat Abī Dāwūd ilā Ahli Makkah; his letter to the inhabitants of Makkah describing his Sunan Abī Dāwūd.[2]",
        "name_en": "Abu Dawood"
    },
    {
        "CollectionID": 5,
        "desc_en": "Jami` at-Tirmidhi (Arabic: جامع الترمذي‎, Jāmi` at-Tirmidhī), popularly and mistakenly Sunan at-Tirmidhi (Arabic: سُـنَن الترمذي‎, Sunan at-Tirmidhī), is one of Kutub al-Sittah (the six major hadith collections). It was collected by Abu `Isa Muhammad ibn `Isa at-Tirmidhi. He began compiling it after the year 250 A.H. and completed it on the 10 Dhu-al-Hijjah 270 A.H. It contains 3,956 Ahadith, and has been divided into fifty chapters. It is also classified as a Sunan, which implies that the book has been chapterised according to legal chapters, such as Purification, Prayer, Poor-due and Fasting, narrated on the authority of Islamic prophet Muhammad, while the opinions of the companions are usually not mentioned.\n\nTirmidhi's method was that of placing the heading first, then mentioning one or two Ahadith which were related to the heading. These Ahadith are followed by his opinion as to the status of the Hadith. Subsequently, he mentions the opinions of the different jurists. He also indicates if there were other narrations transmitted by other companions on the same subject. His principal aim was to discuss the legal opinions of early jurists. Tirmidhi mostly mentioned those Ahadith which the jurists used as the basis for their legal decisions and he mentioned which school used which tradition/s. Hence this book became an important source for the different view-points of the various legal schools. The Jami' thus bears the distinction of being one of the oldest texts dealing with the difference of opinion amongst the various jurisprudential schools. Although Shafi'i (b. 150-d.204 A.H.) wrote his Kitab al-Umm before Tirmidhi's Jami', the Kitab al-Umm is less comprehensive in comparison to the Jami' of Tirmidhi.",
        "name_en": "Jamiat Tirmidhi"
    },
    {
        "CollectionID": 6,
        "desc_en": "Abū ʻAbdillāh Muḥammad ibn Yazīd Ibn Mājah al-Rabʻī al-Qazwīnī (Arabic: ابو عبد الله محمد بن يزيد بن ماجه الربعي القزويني‎; fl. 9th century CE) commonly known as Ibn Mājah, was a medieval scholar of hadith. He compiled the last of Sunni Islam's six canonical hadith collections, Sunan Ibn Mājah. Ibn Mājah was born in Qazwin, the modern-day Iranian province of Qazvin, in 824 CE/209 AH[1] to a family who were clients (mawla) of the Rabīʻah tribe.[2] Mājah was the nickname of his father, and not that of his grandfather nor was it his mother's name, contrary to those claiming this. The hāʼ at the end is un-voweled whether in stopping upon its pronunciation or continuing because it a non-Arabic name.[2]\n\nHe left his hometown to travel the Islamic world visiting Iraq, Makkah, the Levant and Egypt. He studied under Abū Bakr ibn Abī Shaybah (through whom came over a quarter of al-Sunan), Muḥammad ibn ʻAbdillāh ibn Numayr, Jubārah ibn al-Mughallis, Ibrāhīm ibn al-Mundhir al-Ḥizāmī, ʻAbdullāh ibn Muʻāwiyah, Hishām ibn ʻAmmār, Muḥammad ibn Rumḥ, Dāwūd ibn Rashīd and others from their era. Abū Yaʻlā al-Khalīlī praised Ibn Mājah as \"reliable (thiqah), prominent, agreed upon, a religious authority, possessing knowledge and the capability to memorize.\"[1]\n\nAccording to al-Dhahabī, Ibn Mājah died on approximately February 19, 887 CE/with eight days remaining of the month of Ramadan, 273 AH,[1] or, according to al-Kattānī, in either 887/273 or 889/275.[2] He died in Qazwin.",
        "name_en": "Ibn Majah"
    },
    {
        "CollectionID": 7,
        "desc_en": "The Muwaṭṭaʾ (Arabic: الموطأ‎) is the first written collection of hadith comprising the subjects of Muslim law, compiled and edited by the Imam, Malik ibn Anas.[1] Malik's best-known work, Al-Muwatta was the first legal work to incorporate and join hadith and fiqh together. The work was received with wide praise. It is considered to be from the earliest extant collections of hadith that form the basis of Islamic jurisprudence alongside the Qur'an.[2] Nonetheless, is not merely a collection of hadith; many of the legal precepts it contains are based not on hadith at all. The book covers rituals, rites, customs, traditions, norms and laws of the time of the prophet Muhammad.(S.A.W). Due to increase in juristic differences, the Caliph of the time, Abū Ja‘far Mansūr, requested Imam Malik to produce a standard book that could be promulgated as law in the country. The Imam refused this in 148 AH, but when the Caliph again came to the Hijaz in 163 AH, he was more forceful and said:\n\n“O Abū ‘Abd Allāh, take up the reign of the discipline of fiqh in your hands. Compile your understanding of every issue in different chapters for a systematic book free from the extremism of ‘Abd Allāh b. ‘Umar, concessions and accommodations of ‘Abd Allāh b. ‘Abbās and unique views of ‘Abd Allāh b. Mas‘ūd. Your work should exemplify the following principle of the Prophet: “The best issues are those which are balanced.” It should be a compendium of the agreed upon views of the Companions and the elder imāms on the religious and legal issues. Once you have compiled such a work then we would be able to unite the Muslims in following the single fiqh worked by you. We would then promulgate it in the entire Muslim state. We would order that no body acts contrary to it.” [4]\n\nHistorical reports attest that another ‘Abbāsī caliph Hārūn al-Rashīd too expressed similar wishes before Imām Mālik who remained unmoved. He, however, compiled Muwattā, keeping before himself the target of removing the juristic differences between the scholars.",
        "name_en": "Malik Muwatta"
    },
    {
        "CollectionID": 8,
        "desc_en": "He is Abu ^Abdullah, Ahmad bin Muhammad bin Hanbal Ash-Shaibani, known by the name Ibn Hanbal. He was a celebrated theologian, jurist and a Hadith scholar. He is also one of the four Imams of Fiqh. Imam Ahmad was born at Baghdad in Rabi^-ul-‘ula, 164 H. He studied the Hadith and Fiqh together with other Islamic disciplines in Baghdad, then travelled to Ash-Sham and Hijaz for further studies. He was persecuted during the rule of Al-Ma'mun bin Harun Ar-Rashid for refusing to acknowledge the Bid^ah (innovation) introduced by the Mu^ tazilah of claiming that the Qur'an (the Eternal and Everlasting Kalam-Speech of Allah) was created.. He however, stood firm against all the trials and saved the Sunnah from the innovation of the wretched Mu ^tazilah thoughts. He was the mostly persecuted and most firm one amongst all the Imam. He is most famous for collecting the Hadith of the Prophet compiled in the Musnad Ahmad bin Hanbal, which contain 28 to 29 thousand Hadith. It was said that Ibn Hanbal memorized one million Hadith. Ibn Hanbal died in Baghdad on Friday, 12 Rabi^-ul-‘Ula 241 H.",
        "name_en": "Musnad Ahmed"
    },
    {
        "CollectionID": 9,
        "desc_en": "Riyadh as-Saaliheen, translated: \"The Gardens of the Righteous\", is a compilation of verses from the Qur'an and hadith by Imam Nawawi. In total, it contains 680 hadith divided into 372 chapters, many of which are introduced by verses of the Quran. Almost all of the hadith in Riyadh as-Saaliheen is authentic, it contains most of the strong hadith from Al-Bukhari and Muslim and is well regarded by the scholars of hadith.",
        "name_en": "Riyad us Saliheen"
    },
    {
        "CollectionID": 10,
        "desc_en": "The Shamaa‐il of Imaam Abu 'Eesa Timidhi has a collection of 397 ahaadith and is divided into 55 \nchapters on the physical description,character and characteristics of rasoolullah [saw] i.e. how he looked like, what were his habbits, what he liked & disliked in his general daily life & lots more of our beloved nabi sallallahu 'alayhi Wasallam.",
        "name_en": "Shamail Tirmidhi"
    },
    {
        "CollectionID": 11,
        "desc_en": "Al-Adab Al-Mufrad is Imam al-Bukhari's second most well-known work; a collection of 1300 narrations on Islamic etiquette and conduct, it is a fascinating insight into how one should behave as practised by the Prophet Muhammad (PBUH) his companions and the Aimmah of the Tabi'in from the following generation. It tackles a variety of issues, from dealing with specific family members, to how to write letters, to how to go shopping to even on how to walk properly. The unique depth and importance of this book makes it an undeniable calssic.",
        "name_en": "Al-Adab Al-Mufrad"
    },
    {
        "CollectionID": 12,
        "desc_en": "Bulugh al-Maram min Adillat al-Ahkam, translation: Attainment of the Objective According to Evidences of the Ordinances by al-Hafidh ibn Hajar al-Asqalani (1372 – 1448) is a collection of hadith pertaining specifically to Islamic Jurisprudence of the Shafi'i madhab. This genre is referred to in Arabic as Ahadith al-Ahkam.",
        "name_en": "Bulugh al-Maram"
    },
    {
        "CollectionID": 13,
        "desc_en": "Nawawi's Forty (sc. “Forty Hadith”, in Arabic: al-arbaʿīn al-nawawiyyah) is a compilation of forty hadiths by Imam al-Nawawi,[1] most of which are from Sahih Muslim and Sahih al-Bukhari. This collection of hadith has been particularly valued over the centuries because it is a distillation, by one of the most eminent and revered authorities in Islamic jurisprudence, of the foundations of Islamic sacred law or Sharīʿah. In putting together this collection, it was the author's explicit aim that “each hadith is a great fundament (qāʿida ʿaẓīma) of the religion, described by the religious scholars as being ‘the axis of Islam’ or ‘the half of Islam’ or ‘the third of it’ or the like, and to make it a rule that these forty hadith be classified as sound (ṣaḥīḥ).”[2] This work is the most representative of the arbaʿīniyyāt genre of hadith.",
        "name_en": "Nawawi"
    },
    {
        "CollectionID": 14,
        "desc_en": "Forty Hadith Qudsi are widely regarded as the most popular anthology and the best introduction to the study of the Prophet's Sayings in the English language.  The Hadith Qudsi, or sacred hadith, have a particularly important status because their meaning is entirely from Allah (swt) while the wording is that of the Prophet Muhammad (s) himself. For each of the eighty hadith presented, the Arabic original has been printed alongside the English translation, which has earned a reputation for its scholastic accuracy and readability\n\nAmong the many definitions given by the early scholars to Sacred Hadith is that of as-Sayyid ash-Sharif al-Jurjani (died in 816 A.H.) in his lexicon At-Tarifat where he says: \"A Sacred Hadith is, as to the meaning, from Allah the Almighty; as to the wording, it is from the messenger of Allah (peace and blessings of Allah be upon him). It is that which Allah the Almighty has communicated to His Prophet through revelation or in dream, and he, peace be upon him, has communicated it in his own words.\"\n\nThe hadith qudsi are the sayings of the Prophet divinely communicated to him. The present collection has been compiled from all the available books of hadith. The forty chosen here are all well authenticated and present many of the doctrinal, devotional and ethical elements of Islam.",
        "name_en": "Qudsi Hadith"
    }
]